# 字符串和正则表达式

# 使用正则表达式
"""
在编写处理字符串的程序或网页时，经常会有查找符合某些复杂规则的字符串的需要，正则表达式就是用于描述
这些规则的工具，换句话正则表达式是一种工具，它定义了字符串的匹配模式(检查一个字符串是否有跟某种模式
匹配的部分或者从一个字符串中将与模式匹配的部分提取出来或者替换掉)。
如果你在Windows操作系统中使用过文件查找并且在指定文件名时使用过通配符（*和?），
那么正则表达式也是与之类似的用来进行文本匹配的工具，只不过比起通配符正则表达
式更强大，它能更精确地描述你的需求（当然你付出的代价是书写一个正则表达式比打出一个通配
符要复杂得多，要知道任何给你带来好处的东西都是有代价的，就如同学习一门编程语言一样），
比如你可以编写一个正则表达式，用来查找所有以0开头，后面跟着2-3个数字，然后是一个连字
号“-”，最后是7或8位数字的字符串（像028-12345678或0813-7654321），这不就是国内的座机号
码吗。最初计算机是为了做数学运算而诞生的，处理的信息基本上都是数值，而今天我们在日常工
作中处理的信息基本上都是文本数据，我们希望计算机能够识别和处理符合某些模式的文本，正则
表达式就显得非常重要了。今天几乎所有的编程语言都提供了对正则表达式操作的支持，Python通
过标准库中的re模块来支持正则表达式操作。

我们可以考虑下面一个问题：我们从某个地方（可能是一个文本文件，也可能是网络上的一则新
闻）获得了一个字符串，希望在字符串中找出手机号和座机号。当然我们可以设定手机号是11位的
数字（注意并不是随机的11位数字，因为你没有见过“25012345678”这样的手机号吧）而座机号跟
上一段中描述的模式相同，如果不使用正则表达式要完成这个任务就会很麻烦。

关于正则表达式的相关知识，大家可以阅读一篇非常有名的博客叫《正则表达式30分钟入门教程》，
读完这篇文章后你就可以看懂下面的表格，这是我们对正则表达式中的一些基本符号进行的扼要总结。

不会查文档把
链接：https://github.com/jackfrued/Python-100-Days/blob/master/Day01-15/12.%E5%AD%97%E7%AC%A6%E4%B8%B2%E5%92%8C%E6%AD%A3%E5%88%99%E8%A1%A8%E8%BE%BE%E5%BC%8F.md
"""

# python对正则表达式的支持
"""
Python提供了re模块来支持正则表达式相关操作，下面是re模块中的核心函数。
函数											 说明
compile(pattern, flags=0)					 编译正则表达式返回正则表达式对象
match(pattern, string, flags=0)				 用正则表达式匹配字符串 成功返回匹配对象 否则返回None
search(pattern, string, flags=0)			 搜索字符串中第一次出现正则表达式的模式 成功返回匹配对象 否则返回None
split(pattern, string, maxsplit=0, flags=0)	 用正则表达式指定的模式分隔符拆分字符串 返回列表
sub(pattern, repl, string, count=0, flags=0) 用指定的字符串替换原字符串中与正则表达式匹配的模式 可以用count指定替换的次数
fullmatch(pattern, string, flags=0)	match	 函数的完全匹配（从字符串开头到结尾）版本
findall(pattern, string, flags=0)			 查找字符串所有与正则表达式匹配的模式 返回字符串的列表
finditer(pattern, string, flags=0)	 	     查找字符串所有与正则表达式匹配的模式 返回一个迭代器
purge()										 清除隐式编译的正则表达式的缓存
re.I / re.IGNORECASE						 忽略大小写匹配标记
re.M / re.MULTILINE						 	 多行匹配标记
说明： 上面提到的re模块中的这些函数，实际开发中也可以用正则表达式对象的方法替代对这些函数
的使用，如果一个正则表达式需要重复的使用，那么先通过compile函数编译正则表达式并创建出
正则表达式对象无疑是更为明智的选择。
"""

# 例子1：验证输入用户名和qq号是否有效并给出对应的提示信息
"""
验证输入的用户名和qq号是否有效并给出对应的提示信息

要求：用户名必须由字母，数字或下划线构成且长度在6-20和字符之间,qq号是5-12的数字4
且首位不为0
"""
'''
import re

def main():
	username = input('请输入用户名：')
	qq = input('请输入qq号：')
	# match 函数的第一个参数是正则表达式字符串或正则表达式对象
	# 第二个参数是要跟正则表达式做匹配的字符串对象
	m1 = re.match(r'^[0-9a-zA-Z_]{6,20}$',username)
	if not m1:
		print('请输入有效的用户名.')
	m2 = re.match(r'^[1-9]\d{4,11}$',qq)
	if not m2:
		print('请输入有效的qq号.')
	if m1 and m2:
		print('你输入的信息有效的!')
main()
提示： 上面在书写正则表达式时使用了“原始字符串”的写法（在字符串前面加上了r），
所谓“原始字符串”就是字符串中的每个字符都是它原始的意义，说得更直接一点就是字符串中没有
所谓的转义字符啦。
'''

# 例子2：从一段文字内提取出国内手机号码
'''
import re


def main():
    # 创建正则表达式对象 使用了前瞻和回顾来保证手机号前后不应该出现数字
    pattern = re.compile(r'(?<=\D)1[34578]\d{9}(?=\D)')
    sentence = 
    重要的事情说8130123456789遍，我的手机号是13512346789这个靓号，
    不是15600998765，也是110或119，王大锤的手机号才是15600998765。
    
    # 查找所有匹配并保存到一个列表中
    mylist = re.findall(pattern, sentence)
    print(mylist)
    print('--------华丽的分隔线--------')
    # 通过迭代器取出匹配对象并获得匹配的内容
    for temp in pattern.finditer(sentence):
        print(temp.group())
    print('--------华丽的分隔线--------')
    # 通过search函数指定搜索位置找出所有匹配
    m = pattern.search(sentence)
    while m:
        print(m.group())
        # m = pattern.search(sentence, m.end())


if __name__ == '__main__':
    main()
'''

# 例子3：替换字符串中的不良内容
'''
import re

def main():
	sentence = '你丫是傻叉吗? 我操你大爷的.Fuck you.'
	purified = re.sub('[操肏艹]|fuck|shit|傻[比屄逼叉缺吊屌]|煞笔','*',sentence,flags=re.IGNORECASE)
	print(purified)
main()
'''

# 拆分长字符串
'''
import re
def main():
	poem = '窗前明月光，疑是地上霜、举头望明月，低头思故乡。'
	sentence_list = re.split(r'[，。.]',poem)
	while '' in sentence_list:
		sentence_list.remove('')
	print(sentence_list)
main()
'''


"""
后话
如果要从事爬虫类应用的开发，那么正则表达式一定是一个非常好的助手，因为它可以帮助我们迅速
的从网页代码中发现某种我们指定的模式并提取出我们需要的信息，当然对于初学者来收，
要编写一个正确的适当的正则表达式可能并不是一件容易的事情（当然有些常用的正则表达式可以
直接在网上找找），所以实际开发爬虫应用的时候，有很多人会选择Beautiful Soup或Lxml来进行匹配
和信息的提取，前者简单方便但是性能较差，后者既好用性能也好，但是安装稍嫌麻烦，这
些内容我们会在后期的爬虫专题中为大家介绍。
"""


